In [15]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('/home/jaime/jupyter_course/np_pd_course/bestsellers_with_categories.csv', sep = ',', header = 0)

In [8]:
df.head(2)    # devuelve las 2 primeras filas

,Name,Author,User Rating,Reviews,Price,Year
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011

## Drop columns

In [4]:
df.drop('Genre', axis= 1).head(2)   
#con esta sintaxys de drop lo borra solo para el output, a menos que volvamos a reasignar df

,Name,Author,User Rating,Reviews,Price,Year
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011

In [6]:
df.drop('Genre', axis= 1, inplace=True)
# con está sintaxys elimina la columna sin necesidad de reasignar valores

In [7]:
df.head(2)

,Name,Author,User Rating,Reviews,Price,Year
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011

## Drop columns

In [9]:
df.head(2)

,Name,Author,User Rating,Reviews,Price,Year
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011

In [10]:
df.drop(0, axis= 0).head(2)

,Name,Author,User Rating,Reviews,Price,Year
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018

In [11]:
df.drop([0, 1, 2], axis= 0).head(2)

,Name,Author,User Rating,Reviews,Price,Year
3,1984 (Signet Classics),George Orwell,4.7,21424,6,2017
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12,2019

In [12]:
df.drop(range(0, 10), axis= 0).head(2)

,Name,Author,User Rating,Reviews,Price,Year
10,A Man Called Ove: A Novel,Fredrik Backman,4.6,23848,8,2017
11,A Patriot's History of the United States: From...,Larry Schweikart,4.6,460,2,2010

## Add columns

In [13]:
df.head(2)

,Name,Author,User Rating,Reviews,Price,Year
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011

In [17]:
df['New column'] = np.nan
df.head(2)

,Name,Author,User Rating,Reviews,Price,Year,New column
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,NaN
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,NaN

In [18]:
df.shape[0]   # numero de filas

550

In [20]:
data = np.arange(0, df.shape[0])    # entrega en output un array de 500 dígitos

In [21]:
df['Rango'] = data
df.head(2)

,Name,Author,User Rating,Reviews,Price,Year,New column,Rango
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,NaN,0
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,NaN,1

## Add rows

In [ ]:
df.append(df)    # esto duplica los datos a nivel de filas